/* 
   Localizable.strings
   FieldTools

   Created by Brad on 2008/11/11.
   Copyright 2008 Brad Sokol. All rights reserved.
 */
"FIELD_TOOLS_TITLE" = "Field Tools";
"SETTINGS_TITLE" = "Settings";

"CAMERAS_SECTION_TITLE" = "Cameras";
"LENSES_SECTION_TITLE" = "Lenses";
"UNITS_SECTION_TITLE" = "Units";

"CAMERA_ROW_TITLE" = "Camera";
"LENS_ROW_TITLE" = "Lens";

"FEET" = "Feet";
"FEET_AND_INCHES" = "Feet and inches";
"FEET_ABBREVIATION" = "ft";
"METRIC_M" = "Metres";
"METRIC_CM" = "Centimeters";
"METRES_ABBREVIATION" = "m";
"CENTIMETRES_ABBREVIATION" = "cm";

"ADD_CAMERA" = "Add camera...";
"ADD_LENS" = "Add lens...";

"MACRO" = "Macro";

"LENS" = "Lens";
"CAMERA" = "Camera";

"CAMERA_VIEW_TITLE" = "Camera";
"COC_VIEW_TITLE" = "Circle of Confusion";
"CUSTOM_COC_VIEW_TITLE" = "Custom CoC";
"LENS_VIEW_TITLE" = "Lens";

"LENS_VIEW_APERTURE_SECTION_TITLE" = "Aperture";
"LENS_VIEW_FOCAL_LENGTH_SECTION_TITLE" = "Focal Length";
"LENS_VIEW_TYPE_SECTION_TITLE" = "Lens Type";

"INFINITY" = "Infinity";

"DEFAULT_CAMERA_NAME" = "My camera";
"DEFAULT_COC" = "35 mm";
"DEFAULT_LENS_NAME" = "My lens";

"CAMERA_NAME_TITLE" = "Name";
"COC_TITLE" = "Circle of Confusion";

"LENS_NAME_TITLE" = "Name";
"LENS_EDIT_0" = "Minimum"; /* Focal length */
"LENS_EDIT_1" = "Maximum"; /* Focal length */
"LENS_EDIT_2" = "Maximum"; /* Aperture */
"LENS_EDIT_3" = "Minimum"; /* Aperture */

"LENS_EDIT_FOCAL_LENGTH" = "Focal length";

"LENS_TYPE_PRIME" = "Prime";
"LENS_TYPE_ZOOM" = "Zoom";

"CUSTOM_COC_DESCRIPTION" = "Custom";

"COC" = "CoC";

"CLOSE_BUTTON_LABEL" = "Close";

"CAMERA_DATA_VALIDATION_ERROR" = "Input Error";
"CAMERA_ERROR_MISSING_NAME" = "Camera name is required.";
"CAMERA_ERROR_INVALID_COC" = "Circle of confusion must be a number greater than zero and less than one.";

"LENS_DATA_VALIDATION_ERROR" = "Input Error";
"LENS_ERROR_MISSING_NAME" = "Lens name is required.";
"LENS_ERROR_BAD_APERTURE" = "Aperture must be a number greater than %@ and less than %@.";
"LENS_ERROR_BAD_FOCAL_LENGTH" = "Focal length must be a number greater than %@ and less than %@.";

"COC_VALIDATION_ERROR" = "Input Error";
"COC_ERROR_OUT_OF_RANGE" = "CoC must be a number greater than zero and less than one.";

/*
 Appirater strings
 */
"APPIRATER_MESSAGE" = "If you've found %@ to be useful, please take a minute to rate it. Thanks for your support!";
"APPIRATER_TITLE" = "Rate %@";
"APPIRATER_CANCEL" = "No, Thanks";
"APPIRATER_RATE" = "Rate %@";
"APPIRATER_LATER" = "Remind Me Later";

/*
 Perhaps not the cleanest way to store the CoC values, but
 it keeps them with the description. This will be a maintenance
 issue if the text is localised, unless there is a 'default' strings
 file.
 
 No longer used after V1.0. Maintained here for migrating prefs to newer versions.
 */
"CAMERA_DESCRIPTION_0" = "35 mm";
"CAMERA_COC_0" = "0.03";
"CAMERA_DESCRIPTION_1" = "4x5 format";
"CAMERA_COC_1" = "0.15";
"CAMERA_DESCRIPTION_2" = "6x6 format";
"CAMERA_COC_2" = "0.06";
"CAMERA_DESCRIPTION_3" = "Canon APS-C";
"CAMERA_COC_3" = "0.019";
"CAMERA_DESCRIPTION_4" = "Nikon DX";
"CAMERA_COC_4" = "0.02";
"CAMERA_DESCRIPTION_5" = "Olympus 4:3";
"CAMERA_COC_5" = "0.015";
"CAMERA_DESCRIPTION_6" = "Pentax DSLR";
"CAMERA_COC_6" = "0.02";
"CAMERA_DESCRIPTION_7" = "Sony DSLR";
"CAMERA_COC_7" = "0.02";

"SCRUBBING_TIP" = "Slide finger vertically to adjust scrubbing speed.";
"SCRUBBING_HIGH" = "Hi-Speed Scrubbing";
"SCRUBBING_HALF" = "Half Speed Scrubbing";
"SCRUBBING_QUARTER" = "Quarter Speed Scrubbing";
"SCRUBBING_FINE" = "Fine Scrubbing";
